{
  "entries" : {
    "-Lym1q0dsavQyY3Skwr4" : {
      "date" : "2020-01-17T05:31:03.357Z",
      "dateString" : "1/16/2020",
      "id" : 35,
      "name" : "First Entry!",
      "tags" : "Programming",
      "text" : "<h1>Howdy</h1><div>This is the first journal entry I am making on this web app. To start, I would like to talk a little bit about how/why I made this app. Hopefully, a long time from now, I will still be reading and writing entries.</div><div><br></div><h2>The Idea</h2><div>I have had thoughts of keeping a journal before, but knowing me, I would <i>never</i>&#160;hand write a journal entry. I am undoubtedly too lazy for that, and I can barely read my own handwriting sometimes anyway, so I never took the idea too seriously. Over this last winter break, though, I started talking to Haley about her journal somehow, and I became a lot more seriously interested in a journal after hearing her talk about it. Since I had gained a lot of experience developing web apps with HungryAgs (check your github if you forgot; you worked on it with Ian Matson), the idea for a journal web app immediately popped into my head. Thus, &#34;Journ&#34; was born (I hope I come up with a better name at some point).</div><div><br></div><h2>The Development</h2><div>I don't have much to share about the development other than it happened really quickly. I went from nothing to this first entry in less than two weeks, and pretty much everything is fully functional (although the login method isn't very secure right now, hopefully I will fix that lol). While I'm at it, I may as well include an image, so here is my current setup that I used for development.</div><div><img src=\"https://lh3.googleusercontent.com/tSjdafgD1OddqfMwFv7Dwg5f38npVm4USp2XungX1a3eqVyq-tXKVU64O_45nHjuXTQQrLSYdDRSOPanSOuJlByqBUtngDFGeJlzhn57AXcScrNDMld7g87e-2Q6-DGw1CkAOYkW8iBswz6HYKoxvg-xUCi1AipEhYHEe1AMTIJOvHnhveLZ-uDORB0ldMMEF97xBLin3Kal5rPFSsqrGjRnppnBTx8Zf07z20fMD9jya1hJwunF9IskeCMmxyqvW0N9B7yPNBhFOOHchVmX6T37dMfzmMOzuxu1wK9ZwVYqCb5ytFtYxoLWgNxSEvrA5P1BHzor6wNsfWR-SZwhPX_YjMMoeiAZ_HRnfWZ7n9-xBzGNkqTALXIuieXYcrOdhIQm0KOsmypRPAB_umWzY3P6e9wviDxx7ycrGCgjc6EeKvQc6VpxubSXaz9RGoqOzjVkQ1gFbcEsPEMHD_Q9xmpxfqlLV_gzumb54lCFITYAHrwZ1Y6kiq4hDMIfKztBVZxS5zJVNvnyG4hg0GJvN0EGzxpudObkLadTIFT1hgl02rWd3EsgYjUoSOM0lVUnQXNvwaqONhae1-8Fqp8jaDkZJHy6s6B3_OZys6bYf0ezemR7SbxgG_Z9wpDNNIi1Nk0LyRQNh0aWzjXRu51qIGpU-Y5NQrB6MQpjNTTeKAiIruWAInFBbkS_Yc2gXbf6gGsRYTdQiMAZHfXM1UEYl-OURiPEHu3CCZzJ9tSDi3Skukm8=w1251-h938-no\"></div><div>I'll probably be embedding images for a while just because I think it's cool, but anyway, I'll have to remind myself (ahem) that the code for this project is on my github if I ever want to take a look at the source code again!</div><div><br></div><div>Of note, the app was made using Angular 8 and mediocre HTML/CSS skills. The thing I am most proud of is the animated hamburger icon for the pullout sidenav, and all of the hosting/database stuff is taken care of with Google Firebase (Firebase rocks!). Now, I am probably going to write an actual daily entry, but happy first entry!!</div>"
    },
    "-Lym5Ln8gtxMSrrNiFKb" : {
      "date" : "2020-01-17T05:49:48.529Z",
      "dateString" : "1/16/2020",
      "id" : 36,
      "name" : "I moved my legs today",
      "tags" : "Sports,College,School,Running",
      "text" : "Quick context: I am a sophomore right now, it is the beginning of second semester, and I am living with Zach Summers, Andy Garcia, and Travis Cantwell. Whew.<br><h1>Morning Run</h1><div>This is my first daily entry, so we'll see how this goes...</div><div><br></div><div>Today, I did a 4 mile morning run when I woke up! I got up around 9:30 (don't have class until 12:45 with Tyagi on Thursdays ;)) and wasted time on YouTube while waking up, per the usual. After I, the useless meatsack, rolled out of bed at around 10, though, I decided it was the perfect day to really start on my runs for this semester. The plan is to run by myself most (if not all) of the time because then I don't have to worry about anybody else's schedule/pace, and I must say, it felt quite good today. I hope I keep this up!</div><div><br></div><div>Quick stats - My pace was around 7:30/mile, so not too bad (I wasn't pushing myself super hard or anything). I'd like to quicken that and be able to lengthen the distance quite a bit by the end of the semester, but who knows how long I will keep this up haha.</div><div><br></div><h1>My Actual Day...</h1><div>Boring, routine...</div><h2>Classes</h2><div>I went to CSCE 312 with Dr. Tyagi (favorite professor ever, gotta say) at 12:45 with Zach. That lasted until 2:00, we went over some basic class intro stuff, and then I went to Linear Algebra with other Zach (suitemate Zach from freshman year) at 2:20. That lasted until 3:35.</div><div><br></div><div>About Linear Algebra... oh snap my professor (Hao Guo) is awesome. He is Asian, so I was expecting a thick accent that was difficult to understand, but he has the smoothest <i>British</i>&#160;accent ever. I'm afraid he is going to put me to sleep, but his class is also really interesting so far. So who knew, Linear Algebra might be a really surprisingly enjoyable class!</div><h2>After Classes</h2><div>After classes, I went to the MSC to pick up my textbooks (most of which I will never read, for the 4th semester in a row), and I got a couple of hamburgers at Rev's (I always get 2, and it is most definitely an issue haha). I am proud of myself, though, because after I got home, I worked and finished my first problem set for Linear Algebra (plus bonus questions).</div><div><br></div><h1>In Conclusion</h1><div>This was my first opportunity to make a real entry about my day, so I thought I may as well. All in all, it wasn't a very interesting day today, but I should have some better things to talk about coming up (you know, like days where I actually see <i>FRIENDS</i>&#160;and do <i>FUN</i>&#160;things). Pretty happy day today overall, although I am still waiting to see Logan K (haven't seen him since the semester started haha).</div><div><br></div><div>P.S. I should take a picture to embed each day. That would be kinda cool to see.</div>"
    },
    "-Lyu1__9zW-YMg7MkYH0" : {
      "date" : "2020-01-17T06:00:00.000Z",
      "dateString" : "1/17/2020",
      "id" : 37,
      "name" : "Friday Lab Day",
      "tags" : "Programming,Games,Friends,College,School,TV and Movies",
      "text" : "<h1>I had 3 CS labs today...</h1><div>...that lasted from 11:30am to 5:30pm (with a short break in the middle). First, I went to my CSCE 314 lab (using Scheme), and that lab made me feel so good about the class. My partner and I finished pretty early, and it was overall a cakewalk.&#160;</div><div>After that, I went to CSCE 312 for a short bit, but my favorite lab this semester is definitely going to be my competitive programming class. In the lab today, we had 2 hours 15 minutes to solve 7 problems. Some of the problems were kind of tedious, but there were a couple that I really enjoyed. Here are links to my two favorite problems from the contest:</div><div><ol><li>https://open.kattis.com/problems/backspace<br></li><li>https://open.kattis.com/problems/downtime<br></li></ol>For <i>Backspace</i>, the solution I came up with was very simple to code, which made my life easy. Basically, I iterated backwards through the input string, and any time I came across a &#34;&lt;&#34; character, I added its index to a set. In addition, I added 1 to a &#34;delete&#34; counter. Anytime the delete counter was greater than 0, I would ignore a regular character if I came across it (by adding its index to the same set as before). Then, to print the output, I merely printed the characters that were not in the ignore set.</div><div>For <i>Disastrous Downtime</i>, I stored all of the request times in a vector. Then, I iterated through the vector, adding the requests to a queue as I went. Anytime the front of the queue was &gt;= 1000 milliseconds away from the current item I was adding from the vector, I would pop from the queue. Then, I simply had to keep track of the maximum size of the queue to obtain the answer.</div><div>Here is a picture of the leader board from this lab:</div><div><br><img src=\"https://lh3.googleusercontent.com/FRh3FtFk1mzymtWpamSLo8m3CSlQ3vdkP0keUF4ol1Fg91KKVGvSptIogMtCfrkMBK7_rYw7LnreUVDdm1kd9PF2urTds7RP_1jQjSUl5DU3Rv-MCf38SC9_N-fqmXr7TmedZPzylX3kAKK7xuJYPrhwUM3dXATzR1QMAv4El1Iw2_PQeCcVsm1qj3PIJSA3tXorRJCJXEvhbp7c2xdft9SbXSsVh-vZKM0BEW5xpL48fpmV7uSsKXFcgez4iAkFfPn_DxYZogEaD9x7US-m31OycPTO1ErsGUHGWAE4RvoeKD_65VE4P60QuIay1kg8RFL8N_yxSYuQju0JaMTSO29EMWZhdFO-Ie4zwfp0IzYFup7Z-WRT0JaslFxN4hUIJmM2OxgT1NxwlwSbzoBBnKmjdhlvGCDplKsOfGIXNczVaL6qMa3_BIBxPa0c4PZOJ-NbKhoTr7Bit95zKvKqIKmA46B9r6j-b-q3zYa0Ir6M_XFlnmscGaLinKE508LIWUFzjVetn345UCwyWRBoPpTE5RO88zFWHe6Yfw_eNuAbOfsK_CP9o56DrPgIvQrmBMrhImXwmpzGXMMth7WN71vch4_io5Ki0HrOZSuwmKEEg30mZxYIZCQG-sA7aONpx4QTgZDg83wv6-y7chUuD2FXhPpgGHo_HMIxLw8WkMnNEWDsykYlO1OpuDJnNwi3wU1GxqwthHJtEJCGLh_-esxxCTBy8lGwTsdryBT9ufMXqVob=w631-h939-no\"></div><div>I ended up in fifth place, which I was really happy with! Hopefully I can keep up that sort of performance in the future. Scott also solved all of the problems, and Logan/Ian both solved 5/7, so overall a solid performance from all of us, and I think we are all really enjoying those labs together.</div><h1>After lab...</h1><div>...Scott, Ian, Logan, Zach (Summers), and I went to Cane's for dinner (it had been a while, and I had missed it so much lol). We met up with Matthew and Zach (Everman) as well, so it was a really fun dinner with some friends.</div><div>In the evening, Logan and I played a lot of ERS in my apartment, and I gotta say, I am doing <i>much</i>&#160;better than I used to. There were some pretty crazy games that went on for like 15-20 minutes, so I look forward to becoming pretty decent and toxic at the game haha.</div><h1>At night...</h1><div>...I solved all of the problems from the competitive programming weekly problem set, so I am through with homework in there for the next week! There were some pretty cool problems in there, but my favorite was called Kindergarten Excursion. Here is a link to the problem:</div><div><blockquote><div>https://open.kattis.com/problems/excursion<br></div></blockquote>To solve this one (which was an extra credit problem), I first calculated how much each 0 would need to be shifted over. Then, I took a string without any of the zeros and calculated how much the 1s needed to be shifted over. This allowed for O(n) time complexity and was a really simple solution to code. It just took me a while to figure out what I needed to do!</div><div>Anyway, that is about all I have for today. I guess I watched another episode of Mr. Robot, but I pretty much always do that. It's getting pretty interesting with a lot of twists, so I will have to continue watching that. Oh, and Star Trek: Picard comes out in less than a week, so I am <i>SUPER </i>excited about that. All of the preliminary reactions seem to be really positive, so I can't wait to watch it!!!</div>"
    },
    "-LywgNmvau9kffOtqMd3" : {
      "date" : "2020-01-19T04:18:40.214Z",
      "dateString" : "1/18/2020",
      "id" : 38,
      "name" : "Italian Open",
      "tags" : "Sports,Friends,Family,Programming",
      "text" : "<h1>Lunch...</h1><div>...before the Italian Open (we'll get to that later!) was <i>really </i>good. I had never been to Grub Burger Bar, but Lindsay and I decided to go there for lunch, and it was one of the best burgers I've had in a long long time. I can't believe I hadn't ever been there until today. That's about all there is to it, so enjoy picture:</div><div><br><img src=\"https://lh3.googleusercontent.com/4KfS0JcxLDYx_PkUl4yQl0PaMtzUfjsO1J51BqTCi6xVSK9SqyWxSlHPrEENTab5HudsxAyqBLH2u0o0IvwtNqTFooOzJ-HNcZzBWOxwHfFZqE9wQJUkKRDdSKeiAHKx6v6De2CseczuxS1m-2Ze8ZhBuvg04jJcRm0cVIh9Yn3_a65CSYxjbylybSPp-rh64_gP5kD-FAqcDEu5DwFiMQ8A1xR4WFVkR-KpLCJOiQN-8BGmAghiUlnr6AkzPso4O_kY80t3sJHYU-F8DANJ4f9i30KCKyiHNac3J0dvjHfjZNPV55_3sHXT0Yrg7PUBOWG-8ZzSdw0U_3conwHoh_Aer9Dbgh-bp3f7BlNZqVUTzQypr6N4eVxlsTybNy1KnbGcqPcVJYsWURXsrfQEL0_WiEZx8xMIjoPHzQNYPjgd2T1_MLhwtHNt6AATcXu2czYnY2WGiBlkV7Duw9uOcjug8Ar_stmtTkktbmMGUkEIEMiuRFsns_CpXYKwonJIEgbF7D8L1nALWWBOe8bleMKyzyVZ6NqsQmaI0OKkAw9xJACETIrd2uY251nO0EmvujYY4sgrIF0oKEkl6ULLF22-wHDsENwVxGfkaLxHZSie_WgvZxDlQxVN_8Vqpp4GcUw4aly66BLfmnzYCxXb0JrVAYwvIouTfImg9Xa-NOdrcem98BWw4qqFNebrnoVNUKNScGCtp38LC82IjdpfIAOEmX4uSPUCoNeAh_VLfT_DebkJ=w530-h939-no\"></div><h1>The Italian Open...</h1><div>...was a friendly tennis tournament that Logan and Lauren organized for us to play in! I played Logan K in the first round (got the dub ;) ) and Zach (Summers) in the second round. I was surprised that I was able to essentially blowout Zach (8-2 in a pro set I think it was). Essentially, I realized that I could use my higher athleticism and stamina to wear him out during points. He wasn't able to hit anything hard enough for a winner most of the time, so the strategy led to me winning a high percentage of points because it minimized any sort of skill deficiency I might have.</div><div>In the final round, I played Logan (Baker this time) and got pretty much smashed most of the time (8-4 loss), but I played some pretty darn good tennis in the last couple of games. I was down 7-2 and 15-40 (so match point) and managed to come back and take the next two games off of him. I saved like 6 or 8 match points or something, and I was running all over the place. That was probably the most effort I have ever put into a game of tennis, and it felt really good to make some of the plays I was able to make. Here is a picture of the top 3 finishers (the third place is Lauren's boyfriend, Gage):<br><img src=\"https://lh3.googleusercontent.com/w3b-WLkRzfvwbcn-q1vy2YkbWkav3Y_ZFwYeQ7IDv85K-_dhSll_Sn5qlugvhW8nJBlusQIV7JRXDmjB1kZ-PodFCUHSmUxwY3KsmugtdKdyTtZQjfkXO9DvTTA9BXSptgQh4mQO1lGlbPxBh400u97yUY-hIG-5uaOXgfRT-fM6ECgUdDm0VojaT6_f0hBaXmKfYvdbTUC2CVHl9Dn6-3W9rsw-_ELvaxRhNQF-V00BffBq5WqUXsLma3tRrupSa5CUkPY4L8cvOci1ygSlzupb_Cx1gIDpBT5wO6K27asCZ789Mn0RmxrbhFAURHjX8XHda8Tid83jsYoorG6pSwACv5EMb8Wbjl2LfPA782-K9XTdrxL6g4wTLS9PPPiLAodoUy5lOzNdicPhlBRqtb8sLynFmmO2YhLAjImuQvP8_Z1q8-MuW96Ghhx-6_riqLpmZu9yXpNahn_GAPKD147_BqAFccI4iRf1c87CEf8QtAWeueinQJ4FBQTUYKlRF3HJfLU_Gu6mGjjjIU-jpPBFmXmPy7Q_c-RKUkcKEOtNIKhWJ8euvsU-xjkOpqjPYWf7teDlMYHTdAjvpvcvySCDxa2Xsrnc5lhbFLcd3BsQOUxcoXTXO7qpQzT5qKKI1hi34CXC63NOkV8Y2Ru2liHtydG2nDOzLOORmIqV9cis7he8I7-KEmOqPCwvdWmExwqdsD0MNH-bu9BpFRbTEPg4hr3LC3exwn2QFM2A-OgtvGSU=w992-h744-no\"></div><h1><span>Dinner...</span></h1><div>...was at Chick-fil-a after the tennis with Logan and Tanner. We ended up staying there for <i>FOUR </i>hours, so it was a lot of fun talking with them obviously. Some of my favorite conversations centered around competitive programming problems from the CSCE 430 lab/weekly problem set. I find it really cool to hear about how different people are able to come up with pretty clever solutions to the same problem. Oh, also Chick-fil-a rocks because of mobile app reward points.</div><h1>One last thing...</h1><div>...to mention is that it was Dad's birthday today! Mom made him an apple pie, and I got to talk to him for a bit, so all around I think he enjoyed it. Once you've had 57 birthdays, I guess it probably isn't as exciting anymore, but he seems happy which is always a good thing.</div>"
    }
  },
  "nextID" : 39,
  "password" : "testpassword",
  "tags" : "Career,College,Family,Friends,Games,Pioneer,Programming,Relationships,School,Sports,TV and Movies,Running,",
  "username" : "alex.labbane@tamu.edu"
}
